Virtual Environments and Requests Module

In [3]:
#sending a request and logging the response code
import requests
r = requests.get("https://api.github.com/users/agarwalkirti27")
print(r)
print(type(r))

<Response [200]>
<class 'requests.models.Response'>

In [4]:
#accessing the content that we requested from the URL

data = r.content
print(data)

b'{"login":"agarwalkirti27","id":27546532,"node_id":"MDQ6VXNlcjI3NTQ2NTMy","avatar_url":"https://avatars.githubusercontent.com/u/27546532?v=4","gravatar_id":"","url":"https://api.github.com/users/agarwalkirti27","html_url":"https://github.com/agarwalkirti27","followers_url":"https://api.github.com/users/agarwalkirti27/followers","following_url":"https://api.github.com/users/agarwalkirti27/following{/other_user}","gists_url":"https://api.github.com/users/agarwalkirti27/gists{/gist_id}","starred_url":"https://api.github.com/users/agarwalkirti27/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/agarwalkirti27/subscriptions","organizations_url":"https://api.github.com/users/agarwalkirti27/orgs","repos_url":"https://api.github.com/users/agarwalkirti27/repos","events_url":"https://api.github.com/users/agarwalkirti27/events{/privacy}","received_events_url":"https://api.github.com/users/agarwalkirti27/received_events","type":"User","site_admin":false,"name":"writekirti","company":"JPMC","blog":"","location":"India","email":null,"hireable":null,"bio":null,"twitter_username":"agarwalkirti27","public_repos":8,"public_gists":0,"followers":0,"following":1,"created_at":"2017-04-15T08:00:55Z","updated_at":"2022-02-07T16:08:43Z"}'

In [5]:
#converting data into json 

data = r.json()
for k,v in data.items():
    print("key: {}\t values: {}".format(k, v))
print(data["name"])

key: login	 values: agarwalkirti27
key: id	 values: 27546532
key: node_id	 values: MDQ6VXNlcjI3NTQ2NTMy
key: avatar_url	 values: https://avatars.githubusercontent.com/u/27546532?v=4
key: gravatar_id	 values:
key: url	 values: https://api.github.com/users/agarwalkirti27
key: html_url	 values: https://github.com/agarwalkirti27
key: followers_url	 values: https://api.github.com/users/agarwalkirti27/followers
key: following_url	 values: https://api.github.com/users/agarwalkirti27/following{/other_user}
key: gists_url	 values: https://api.github.com/users/agarwalkirti27/gists{/gist_id}
key: starred_url	 values: https://api.github.com/users/agarwalkirti27/starred{/owner}{/repo}
key: subscriptions_url	 values: https://api.github.com/users/agarwalkirti27/subscriptions
key: organizations_url	 values: https://api.github.com/users/agarwalkirti27/orgs
key: repos_url	 values: https://api.github.com/users/agarwalkirti27/repos
key: events_url	 values: https://api.github.com/users/agarwalkirti27/events{/privacy}
key: received_events_url	 values: https://api.github.com/users/agarwalkirti27/received_events
key: type	 values: User
key: site_admin	 values: False
key: name	 values: writekirti
key: company	 values: JPMC
key: blog	 values:
key: location	 values: India
key: email	 values: None
key: hireable	 values: None
key: bio	 values: None
key: twitter_username	 values: agarwalkirti27
key: public_repos	 values: 8
key: public_gists	 values: 0
key: followers	 values: 0
key: following	 values: 1
key: created_at	 values: 2017-04-15T08:00:55Z
key: updated_at	 values: 2022-02-07T16:08:43Z
writekirti

In [6]:
# outputting specific key-value pairs from data
r = requests. get("https://api.github.com/search/repositories?q=language:python")
data = r.json( )
print(data["total_count"])

8021342

Monday Exercise

In [ ]:
# Test Environment: Create a new virtual environment called “test.” When
# creating it, install Python version 2.7 instead of the current version. After
# it’s completed, make sure it installed the proper version of Python by
# checking the list.

# conda create --name test pyhton=2.7

In [7]:
# JavaScript Repositories: Using the requests module and the Github API link in
# our last lesson, figure out how many repositories on Github use JavaScript.

r = requests. get("https://api.github.com/search/repositories?q=language:JavaScript")
data = r.json( )
print(data["total_count"])

13531308

In [8]:
#Pandas
#High performance, highly efficient, high level data analysis library
#written in C
#allows us to work with large datasets called data frames
# NumPy is a fundamental package for scientific computing in Python. Built
# from the C language, it uses multidimensional arrays and can perform calculations
# at high-rate speeds.

In [ ]:
# • Series ➤ One-dimensional labeled array capable of holding data of
# any type
# • DataFrame ➤ Spreadsheet
# • Axis ➤ Column or row, axis = 0 by row; axis = 1 by column
# • Record ➤ A single row
# • dtype ➤ Data type for DataFrame or series object
# • Time Series ➤ Series object that uses time intervals, like tracking
# weather by the hour

In [31]:
#Pandas

import pandas as pd

#using the from_dict method to convert a dictionary into Pandas Data Frame
import random

random.seed(3)
names = ["Jess", "Jordan", "John", "Ted", "Barney", "Tyler", "Rebecca"]
ages = [random.randint(18, 35) for x in range(len(names))]

people = {"names" : names, "ages":ages}
df = pd.DataFrame.from_dict(people)

print(df)

#indexing by column
print(df["ages"][3])

#indexing by record
#directly selecting a record in pandas using loc

print(df.loc[0])
print(df.loc[0]["names"])

     names  ages
0     Jess    25
1   Jordan    35
2     John    22
3      Ted    29
4   Barney    33
5    Tyler    20
6  Rebecca    18
29
names    Jess
ages       25
Name: 0, dtype: object
Jess

In [32]:
#slicing dataframe to grab a specific number of records

print(df[2:4])

  names  ages
2  John    22
3   Ted    29

In [33]:
#head()

#accessing top5 records using head method

print(df.head(5))

    names  ages
0    Jess    25
1  Jordan    35
2    John    22
3     Ted    29
4  Barney    33

In [34]:
#tail()
#accessing bottom 3 records using tail()

print(df.tail(3))

     names  ages
4   Barney    33
5    Tyler    20
6  Rebecca    18

In [35]:
#keys()

#accessing the coulumn header using keys method

headers = df.keys()
print(headers)

Index(['names', 'ages'], dtype='object')

In [37]:
#checking the shape which is the number of records and colums
print(df.shape) # 7 rows and 2 columns

(7, 2)

In [38]:
#checking the general statistics of DataFrame by describe method, only works on numeric columns

df.describe()

            ages
count   7.000000
mean   26.000000
std     6.531973
min    18.000000
25%    21.000000
50%    25.000000
75%    31.000000
max    35.000000

In [45]:
#sort based on given column name but keep the data frame intact using sort_values()
df = df.sort_values("ages")
print(df.head(5));

     names  ages
6  Rebecca    18
5    Tyler    20
2     John    22
0     Jess    25
3      Ted    29

In [47]:
df = df.sort_values(["names"])
print(df.head(5));

     names  ages
4   Barney    33
0     Jess    25
2     John    22
1   Jordan    35
6  Rebecca    18

#Filteration

In [49]:
#using a conditional to create true/false column to work with 

can_drink = df["ages"] > 21

print(can_drink)

4     True
0     True
2     True
1     True
6    False
3     True
5    False
Name: ages, dtype: bool

In [50]:
#using subsetting to filter out records and keeping the data frame intact
df[df["ages"] > 21]

    names  ages
4  Barney    33
0    Jess    25
2    John    22
1  Jordan    35
3     Ted    29

In [ ]:
#>>> dataframe_variable [ conditional statement to filter records with ]
#>>> df[ can_drink ]

column Transformations

In [51]:
#generating a new column of fake data for each record in the dataframe
random.seed(321)

tenure = [random.randint(0, 10) for x in range(len(df))]
df["tenure"] = tenure

df.head()

     names  ages  tenure
4   Barney    33       4
0     Jess    25       6
2     John    22       2
1   Jordan    35       5
6  Rebecca    18       8

In [52]:
#apply() Feature engineering

#feature engineering a column from known data using a UDF(user defined function)

def ageGroup(age):
    return "Teenager" if age < 21 else "Adult"

df["age_group"] = df["ages"].apply(ageGroup)
df.head(10)

# Note When you need to apply a value based on multiple columns, you must set
# the axis = 1.

     names  ages  tenure age_group
4   Barney    33       4     Adult
0     Jess    25       6     Adult
2     John    22       2     Adult
1   Jordan    35       5     Adult
6  Rebecca    18       8  Teenager
3      Ted    29       7     Adult
5    Tyler    20       5  Teenager

Aggregations

In [53]:
#groupby()

#grouping the records together into a count to check records in each age group
df.groupby("age_group", as_index = False).count().head()

  age_group  names  ages  tenure
0     Adult      5     5       5
1  Teenager      2     2       2

In [55]:
#mean()
#grouping the data to see average of columns

df.groupby("age_group", as_index = False).mean().head()

  age_group  ages  tenure
0     Adult  28.8     4.8
1  Teenager  19.0     6.5

In [58]:
#grouping the information by their age group and then by tenure

df.groupby(["age_group", "tenure"], as_index = False).count().head()

  age_group  tenure  names  ages
0     Adult       2      2     2
1     Adult       4      1     1
2     Adult       5      1     1
3     Adult       6      1     1
4     Adult       7      1     1

In [57]:
#adding a record to the bottom of the data frame
df.loc[7] = [25, "Jess", 2, "Adult"]
df.head(10)

     names  ages  tenure age_group
4   Barney    33       4     Adult
0     Jess    25       6     Adult
2     John    22       2     Adult
1   Jordan    35       5     Adult
6  Rebecca    18       8  Teenager
3      Ted    29       7     Adult
5    Tyler    20       5  Teenager
7       25  Jess       2     Adult

In [59]:
#drop duplicates
#removing duplicates based on some names

df = df.drop_duplicates(subset = "names")
df.head()

     names ages  tenure age_group
4   Barney   33       4     Adult
0     Jess   25       6     Adult
2     John   22       2     Adult
1   Jordan   35       5     Adult
6  Rebecca   18       8  Teenager

In [ ]:
#Pandas Joins

In [65]:
#creating another data frame

ratings = {"names" : ["Jess", "Tyler", "Ted"], "ratings" : [10, 9, 6]}
ratings = df.from_dict(ratings)
ratings.head()

   names  ratings
0   Jess       10
1  Tyler        9
2    Ted        6

In [67]:
#inner join
#performing inner join on our data frame
matched_ratings = df.merge(ratings, on= "names", how = "inner")
matched_ratings.head()

   names ages  tenure age_group  ratings
0   Jess   25       6     Adult       10
1    Ted   29       7     Adult        6
2  Tyler   20       5  Teenager        9

In [68]:
#outer join
#performing outer join on data frames

all_ratings = df.merge(ratings, on = "names", how="outer")
all_ratings.head()

     names ages  tenure age_group  ratings
0   Barney   33       4     Adult      NaN
1     Jess   25       6     Adult     10.0
2     John   22       2     Adult      NaN
3   Jordan   35       5     Adult      NaN
4  Rebecca   18       8  Teenager      NaN

TUESDAY EXERCISE

In [4]:
# Loading a Dataset: Go to www.Kaggle.com, click “Datasets” in the top
# bar menu. Choose a dataset that you like, and download it into the “python_
# bootcamp” folder. Then, load the dataset into a Pandas DataFrame using the
# read_csv method, and display the top five records.

import pandas as pd

dataset = pd.read_csv("IPL_AUCTION_2013-2022.csv")
dataset.head(10)

,PLAYER,NATIONALITY,TYPE,PRICE,SOLD/UNSOLD,TEAM,YEAR
0,Robin Uthappa,Indian,Batsman,20000000,SOLD,Chennai Super Kings,2022
1,Dwayne Bravo,Overseas,All-Rounder,44000000,SOLD,Chennai Super Kings,2022
2,Ambati Rayudu,Indian,Wicket Keeper,67500000,SOLD,Chennai Super Kings,2022
3,Deepak Chahar,Indian,Bowler,140000000,SOLD,Chennai Super Kings,2022
4,C.Hari Nishaanth,Indian,Batsman,2000000,SOLD,Chennai Super Kings,2022
5,N. Jagadeesan,Indian,Wicket Keeper,2000000,SOLD,Chennai Super Kings,2022
6,K.M. Asif,Indian,Bowler,2000000,SOLD,Chennai Super Kings,2022
7,Tushar Deshpande,Indian,Bowler,2000000,SOLD,Chennai Super Kings,2022
8,Shivam Dube,Indian,All-Rounder,40000000,SOLD,Chennai Super Kings,2022
9,Chris Jordan,Overseas,All-Rounder,36000000,SOLD,Chennai Super Kings,2022

In [5]:
# Dataset Analysis: This is an open-ended exercise. Run some analysis on the
# dataset you chose from exercise #1. Try to answer questions like these:
# a. How many records are there?
# b. What are the data types of each column?
# c. Are there duplicate records or columns?
# d. Is there missing data?
# e. Is there a correlation between two or more columns?

#a. How many records are there?

index = dataset.index
print(len(index))

3862